//https://github.com/YaDmitryE/D.Z.2.6

#include <stdio.h>
#include <locale.h>

int main()


{
	setlocale(LC_ALL, "Russian");
    int d, m, y;
    printf("РІРІРµРґРёС‚Рµ РґР°С‚Сѓ СЂРѕР¶РґРµРЅРёСЏ \n");
    printf("РґРµРЅСЊ: ");
    scanf("%i",&d);
    printf("РјРµСЃСЏС†: ");
    scanf("%i", &m);
    printf("РіРѕРґ: ");
    scanf("%i", &y);
    if ((d <= 0) || (d>31) || (m <= 0
	) || (m > 12) || (y < 0)) {
        printf("РЅРµРІРµСЂРЅС‹Р№ С„РѕСЂРјР°С‚ РІРІРѕРґР°");
    }
    else {
        printf("Р’Р°С€Р° РґР°С‚Р° СЂРѕР¶РґРµРЅРёСЏ: %i.%i.%i \n", d, m, y);
        int y1 = y % 4;
        if (y1 == 0) {
            printf("Р’С‹ СЂРѕРґРёР»РёСЃСЊ РІ РІРёСЃРѕРєРѕСЃРЅС‹Р№ РіРѕРґ \n");
        }
        else {
            printf("Р’С‹ СЂРѕРґРёР»РёСЃСЊ РІ РЅРµРІРёСЃРѕРєРѕСЃРЅС‹Р№ РіРѕРґ \n");
        }
        int y2 = y % 12;
        printf("РЎРѕРіР»Р°СЃРЅРѕ Р’РѕСЃС‚РѕС‡РЅРѕРјСѓ РєР°Р»РµРЅРґР°СЂСЋ, РІС‹ СЂРѕРґРёР»РёСЃСЊ РІ РіРѕРґ ");
        switch (y2) {
        case 0: {
            printf("РѕР±РµР·СЊСЏРЅС‹ \n");
        }
              break;
        case 1: {
            printf("РїРµС‚СѓС…Р° \n");
        }
              break;
        case 2: {
            printf("СЃРѕР±Р°РєРё \n");
        }
              break;
        case 3: {
            printf("СЃРІРёРЅСЊРё \n");
        }
              break;
        case 4: {
            printf("РєСЂС‹СЃС‹ \n");
        }
              break;
        case 5: {
            printf("Р±С‹РєР° \n");
        }
              break;
        case 6: {
            printf("С‚РёРіСЂР° \n");
        }
              break;
        case 7: {
            printf("РєСЂРѕР»РёРєР° \n");
        }
              break;
        case 8: {
            printf("РґСЂР°РєРѕРЅР° \n");
        }
              break;
        case 9: {
            printf("Р·РјРµРё \n");
        }
              break;
        case 10: {
            printf("Р»РѕС€Р°РґРё \n");
        }
               break;
        case 11: {
            printf("РѕРІС†С‹ \n");
        }
               break;
        default: {
            printf("РѕС€РёР±РєР°");
            break;
        }
        }
        printf("Р’Р°С€ Р·РЅР°Рє Р·РѕРґРёР°РєР° ");
        if (((d >= 22) && (m == 12)) || ((d <= 20) && (m == 1))) {
            printf("РєРѕР·РµСЂРѕРі \n");
        }
        else {
            if (((d >= 21) && (m == 1)) || ((d <= 19) && (m == 2))) {
                printf("РІРѕРґРѕР»РµР№ \n");
            }
            else {
                if (((d >= 20) && (m == 2)) || ((d <= 20) && (m == 3))) {
                    printf("СЂС‹Р±С‹ \n");
                }
                else {
                    if (((d >= 21) && (m == 3)) || ((d <= 20) && (m == 4))) {
                        printf("РѕРІРµРЅ \n");
                    }
                    else {
                        if (((d >= 21) && (m == 4)) || ((d <= 21) && (m == 5))) {
                            printf("С‚РµР»РµС† \n");
                        }
                        else {
                            if (((d >= 22) && (m == 5)) || ((d <= 21) && (m == 6))) {
                                printf("Р±Р»РёР·РЅРµС†С‹ \n");
                            }
                            else {
                                if (((d >= 22) && (m == 6)) || ((d <= 22) && (m == 7))) {
                                    printf("СЂР°Рє \n");
                                }
                                else {
                                    if (((d >= 23) && (m == 7)) || ((d <= 21) && (m == 8))) {
                                        printf("Р»РµРІ \n");
                                    }
                                    else {
                                        if (((d >= 22) && (m == 8)) || ((d <= 23) && (m == 9))) {
                                            printf("РґРµРІР° \n");
                                        }
                                        else {
                                            if (((d >= 24) && (m == 9)) || ((d <= 23) && (m == 10))) {
                                                printf("РІРµСЃС‹ \n");
                                            }
                                            else {
                                                if (((d >= 24) && (m == 10)) || ((d <= 22) && (m == 11))) {
                                                    printf("СЃРєРѕСЂРїРёРѕРЅ \n");
                                                }
                                                else {
                                                    if (((d >= 23) && (m == 11)) || ((d <= 22) && (m == 12))) {
                                                        printf("СЃС‚СЂРµР»РµС† \n");
                                                    }
                                                }
                                            }
                                        }
                                    }
                                }
                            }
                        }
                    }
                }
            }
        }
    }
    return 0;
}
